CSI API ETABS v1

# cAutoSeismic Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cAutoSeismic

    Public Interface cAutoSeismic

    Dim instance As cAutoSeismic

    public interface class cAutoSeismic

    type cAutoSeismic =  interface end

The cAutoSeismic type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetASCE716|  Retrieves auto
seismic loading parameters for the 2016 ASCE 7 code
|
SetASCE716|  Defines auto seismic
loading parameters for the 2016 ASCE 7 code
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com